{"data":{"id":2,"documentId":"fj77dy8vow15r4wp0m3r67dn","Heading":"CODE OF ETHICS POLICY","subHeading":"We commit to honesty, fairness, and ethical excellence in all our actions.","Content":"<div><h3>Policy brief &amp; purpose</h3><p>EsyCommerce Digital Services LLP (hereinafter referred to as “EsyCommerce”) functions with a professional code of ethics policy aimed to give our employees guidelines on our business ethics and stance on various controversial matters. We trust you to use your better judgment, but we want to provide you with a concrete guide you can fall back on if you’re unsure about how you should act (e.g. in cases of conflict of interest). We will also use this policy to outline the consequences of violating our business code of ethics.</p><h3>Scope</h3><p>This policy applies to everyone we employ or have business relations with. This includes individual people such as employees, interns, volunteers, but also business entities, such as vendors, enterprise customers or venture capital companies. Note that our code of ethics is slightly different than our code of conduct. Code of conduct may include elements such as dress code and social media use, whilst our code of professional ethics refers to legally or morally charged issues. Still, these two codes do overlap.</p><h3>Policy elements</h3><h3>What is meant by code of professional ethics?</h3><p>Professional ethics are a set of principles that guide the behavior of people in a business context. They are essential to maintaining the legality of business and a healthy workplace.</p><h3>What is the purpose of a professional code of ethics?</h3><p>Having our business ethics in writing doesn’t mean that we don’t trust our employees. We strive to hire ethical people who have their own personal standards, so we expect that a written code won’t be necessary most of the time. But, it can still be helpful. You may find yourself in a situation where you’re not sure how you should act. Life is full of grey areas where right and wrong aren’t so apparent. Some professional ethics also correspond to laws that you absolutely must know to do your job properly, so we will mention them in our code of ethics. Additionally, every organization makes bad hires every once in a while. We also can’t predict how people are going to behave. When an employee behaves, or intents to behave, in a way that’s against our professional ethics, or applicable laws, we will have clear guidelines on what disciplinary actions we will consider. For these reasons, we advise you to read this document carefully and consult with your manager or HR, if you have doubts or questions.</p><h3>The components of our code of professional ethics:</h3><p>We base our business code of ethics on common principles of ethics:</p><ul><li><span>Respect for others.</span> Treat people as you want to be treated.</li><li><span>Integrity and honesty.</span> Tell the truth and avoid any wrongdoing to the best of your ability.</li><li><span>Justice.</span> Make sure you’re objective and fair and don’t disadvantage others.</li><li><span>Lawfulness.</span> Know and follow the law – always.</li><li><span>Competence and accountability. </span>{\" \"} Work hard and be responsible for your work.</li><li><span>Teamwork.</span> Collaborate and ask for help.</li></ul><p>Here’s a more detailed overview of our code:</p><p>&nbsp;</p><h3>Respect for others</h3><p>It’s mandatory to respect everyone you interact with. Be kind, polite and understanding. You must respect others’ personal space, opinions and privacy. Any kind of violence is strictly prohibited and will result in immediate termination. You’re also not allowed to harass or victimize others. What constitutes harassment or victimization? To answer this, we have a policy on harassment and a more specific policy on sexual harassment you can take a look at. As a general rule, try to put yourself in someone else’s place. How would you feel if someone behaved a specific way to you? If the answer is “I wouldn’t like it much” or “I would never let them behave like that to me”, then we don’t tolerate this behavior no matter the person it comes from. If someone, be it customer, colleague or stakeholder, is offensive, demeaning or threatening toward you or someone you know, report them immediately to HR or your manager. You can also report rudeness and dismissiveness if they become excessive or frequent</p><h3>Integrity and honesty</h3><p>First, always keep in mind our organization’s mission. We all work together to achieve specific outcomes. Your behavior should contribute to our goals, whether financial or organizational. Be honest and transparent when you act in ways that impact other people (e.g. taking strategic decisions or deciding on layoffs). We don’t tolerate malicious, deceitful or petty conduct. Lies and cheating are huge red flags and, if you’re discovered, you may face progressive discipline or immediate termination depending on the damage you did. Stealing from the company or other people is illegal. If you’re caught, you will face repercussions depending on the severity of your actions. For example, if you steal office supplies, you may receive a reprimand or demotion (at a minimum), while if you steal money or data (e.g. engaging in fraud or embezzlement), you will get fired and face legal consequences. The decision is at HR’s discretion on a case-by-case basis.</p><h3>Conflict of interest</h3><p>Conflict of interest may occur whenever your interest in a particular subject leads you to actions, activities or relationships that undermine our company. This includes situations like using your position’s authority for your own personal gain or exploiting company resources to support a personal moneymaking business. Even when you seemingly act to the company’s advantage, you may actually disadvantage it. For example, if an employee uses dubious methods to get competitor intel and raise their sales record, their action will have a positive impact on the company’s revenue, but it will put us at a legal risk and promote unhealthy business practices. If it turns out you have created a conflict of interest for yourself, you will be terminated. If the conflict of interest was involuntary (e.g. buying stocks from a company without knowing they’re a competitor), we will take actions to rectify the situation. If you repeat the offence, you may be terminated.</p><h3>Justice</h3><p>Don’t act in a way that exploits others, their hard work or their mistakes. Give everyone equal opportunity and speak up when someone else doesn’t. Be objective when making decisions that can impact other people, including when you’re deciding to hire, promote or fire someone. Be sure that you can justify any decision with written records or examples. Seek and use the most objective methods in any case; for example, when interviewing candidates, ask the same interview questions to all of them and avoid judging non-job-related criteria, like dress, appearance, etc. Also, don’t discriminate against people with protected characteristics, as this is forbidden by law. If you suspect you may have an unconscious bias that influences your decisions (taking Harvard’s Implicit Association Test could help you determine this), ask for help from HR. When exercising authority, be fair. Don’t show favoritism toward specific employees and be transparent when you decide to praise or reward an employee. You’re also obliged to follow our employment of relatives policy, which forbids you from having a reporting relationship with a relative. If you need to discipline an employee, be sure to have prepared a case that you can present to HR. You must not retaliate against employees or applicants (such as in cases when they’ve filed complaints) as this is forbidden by law. Be just toward customers or vendors, too. If you think our company was in the wrong in a specific instance, don’t try to cover it up or accuse the other side. Discuss with your manager to find solutions that can benefit both sides.</p><h3>Lawfulness</h3><p>You are obliged to follow all laws which apply to our organization. Depending on your role and profession, there might be various laws you need to observe. For example, accountants and medical professionals have their own legal restrictions and they must be fully aware of them. When you’re preparing contracts, clauses, disclaimers or online copy that may be governed by law (such as consent forms), please ask verification from [our legal counsel] before finalizing anything. You’re also covered by our confidentiality and data protection policy. You must not expose, disclose or endanger information of customers, employees, stakeholders or our business. Always follow our cybersecurity policy, too. Following laws regarding fraud, bribery, corruption and any kind of assault is a given. You are also obliged to follow laws on child labor and avoid doing business with unlawful organizations. If you’re not sure what the law is in a specific instance, don’t hesitate to ask HR or our legal counsel.</p><h3>Competence and accountability</h3><p>We all need to put a healthy amount of effort in our work. Not just because we’re all responsible for the organization’s success, but also because slacking off affects our colleagues. Incomplete or slow working might hinder other people’s work or cause them to shoulder the burden themselves. This comes in direct conflict with our respect and integrity principles. We also expect you to take up opportunities for learning and development, either on-the-job or via educational material or training. If you are unsure how you can achieve this, have an open discussion with your manager. Also, take responsibility for your actions. We all make mistakes or need to make tough decisions and it’s important we own up to them. Failing to be accountable on a regular basis or in important situations (e.g. a crucial mistake in our financial records) will result in termination. If you take responsibility and come up with ways to fix your mistakes where possible, you will be in a far better position.</p><h3>Teamwork</h3><p>Working well with others is a virtue, rather than an obligation. You will certainly get to work autonomously and be focused on your own projects and responsibilities. But, you should also be ready to collaborate with and help others. Be generous with your expertise and knowledge. Be open to learning and evolving. If days go by without you consulting or brainstorming with anyone, you are missing out on opportunities for excellence. Instead, work with others and don’t hesitate to ask for help when you need it.</p></div>","createdAt":"2025-04-04T09:08:29.407Z","updatedAt":"2025-04-04T09:08:29.407Z","publishedAt":"2025-04-04T09:08:29.442Z"},"meta":{}}